CREATE OR REPLACE PROCEDURE HRBZLS."SP_REMAININVSEARCH" (
                  o_base out tools.out_base) is
  begin

    open o_base for
select  pcid                                         C1  ,       --ÓÃ»§ºÅ                    C1
        pmid                                         C2  ,       --Ë®±í±àºÅ                  C2
        micode                                       C3  ,       --×ÊÁÏºÅ                    C3
        ciname                                       C4  ,       --ÓÃ»§Ãû                    C4
        miadr                                        C5  ,       --±íµØÖ·                    C5
        pdate                                        C6  ,       --ÕÊÎñÈÕÆÚ                  C6
        psavingqc                                    C7  ,       --ÆÚ³õÔ¤´æÓà¶î              C7
        psavingbq                                    C8  ,       --±¾ÆÚ·¢ÉúÔ¤´æ½ð¶î          C8
        psavingqm                                    C9  ,       --ÆÚÄ©Ô¤´æÓà¶î              C9
        PCD                                          C10 ,       --½è´û·½Ïò                  C10
        fGetOperName(pper)                           C11 ,       --ÏúÕÊÈËÔ±                  C11
        tools.fuppernumber(psavingbq)                C12 ,       --½ð¶î´óÐ´                  C12
        psavingbq                                    C13 ,       --½ð¶îºÏ¼Æ                  C13
        fGetOperName(c2)                             C14 ,       --´òÓ¡Ô±                    C14
        '±¾´ÎÔ¤ÊÕ½ð¶î:'||tools.fformatnum(psavingbq, 2)||'ÉÏ´Î½áÓà:'||tools.fformatnum(psavingqc, 2)||'±¾´Î½áÓà:'||tools.fformatnum(psavingqm, 2)   C15,        --Ô¤´æÃ÷Ï¸                  C15
        'Ô¤Áô×Ö¶Î1'                                  C16  ,          --Ô¤Áô×Ö¶Î1                 C16
        'Ô¤Áô×Ö¶Î2'                                  C17  ,          --Ô¤Áô×Ö¶Î2                 C17
        'Ô¤Áô×Ö¶Î3'                                  C18  ,          --Ô¤Áô×Ö¶Î3                 C18
        'Ô¤Áô×Ö¶Î4'                                  C19  ,          --Ô¤Áô×Ö¶Î4                 C19
        'Ô¤Áô×Ö¶Î5'                                  C20  ,          --Ô¤Áô×Ö¶Î5                 C20
        'Ô¤Áô×Ö¶Î6'                                  C21  ,          --Ô¤Áô×Ö¶Î6                 C21
        'Ô¤Áô×Ö¶Î7'                                  C22  ,          --Ô¤Áô×Ö¶Î7                 C22
        'Ô¤Áô×Ö¶Î8'                                  C23  ,          --Ô¤Áô×Ö¶Î8                 C23
        'Ô¤Áô×Ö¶Î9'                                  C24  ,          --Ô¤Áô×Ö¶Î9                 C24
        'Ô¤Áô×Ö¶Î10'                                 C25  ,          --Ô¤Áô×Ö¶Î10                C25
        'Ô¤Áô×Ö¶Î11'                                 C26  ,          --Ô¤Áô×Ö¶Î11                C26
        'Ô¤Áô×Ö¶Î12'                                 C27  ,          --Ô¤Áô×Ö¶Î12                C27
        'Ô¤Áô×Ö¶Î13'                                 C28  ,          --Ô¤Áô×Ö¶Î13                C28
        'Ô¤Áô×Ö¶Î14'                                 C29  ,          --Ô¤Áô×Ö¶Î14                C29
        'Ô¤Áô×Ö¶Î15'                                 C30  ,          --Ô¤Áô×Ö¶Î15                C30
        'Ô¤Áô×Ö¶Î16'                                 C31  ,          --Ô¤Áô×Ö¶Î16                C31
        'Ô¤Áô×Ö¶Î17'                                 C32  ,          --Ô¤Áô×Ö¶Î17                C32
        'Ô¤Áô×Ö¶Î18'                                 C33  ,          --Ô¤Áô×Ö¶Î18                C33
        'Ô¤Áô×Ö¶Î19'                                 C34  ,          --Ô¤Áô×Ö¶Î19                C34
        'Ô¤Áô×Ö¶Î20'                                 C35  ,          --Ô¤Áô×Ö¶Î20                C35
         PID                                         C36  ,          --¸¶¿î½»Ò×Á÷Ë®ºÅ            C36
         c2                                          C37  ,          --´òÓ¡Ô±±àºÅ                C37
         c3                                          C38  ,          --ÐòºÅ                      C38
        'ÏµÍ³Ô¤Áô×Ö¶Î1'                              C39  ,          --ÏµÍ³Ô¤Áô×Ö¶Î1             C39
        'ÏµÍ³Ô¤Áô×Ö¶Î2'                              C40  ,          --ÏµÍ³Ô¤Áô×Ö¶Î2             C40
        'ÏµÍ³Ô¤Áô×Ö¶Î3'                              C41  ,          --ÏµÍ³Ô¤Áô×Ö¶Î3             C41
        'ÏµÍ³Ô¤Áô×Ö¶Î4'                              C42  ,          --ÏµÍ³Ô¤Áô×Ö¶Î4             C42
        'ÏµÍ³Ô¤Áô×Ö¶Î5'                              C43  ,          --ÏµÍ³Ô¤Áô×Ö¶Î5             C43
        'ÏµÍ³Ô¤Áô×Ö¶Î6'                              C44  ,          --ÏµÍ³Ô¤Áô×Ö¶Î6             C44
        'ÏµÍ³Ô¤Áô×Ö¶Î7'                              C45  ,          --ÏµÍ³Ô¤Áô×Ö¶Î7             C45
        'ÏµÍ³Ô¤Áô×Ö¶Î8'                              C46  ,          --ÏµÍ³Ô¤Áô×Ö¶Î8             C46
        'ÏµÍ³Ô¤Áô×Ö¶Î9'                              C47  ,          --ÏµÍ³Ô¤Áô×Ö¶Î9             C47
        'ÏµÍ³Ô¤Áô×Ö¶Î10'                             C48             --ÏµÍ³Ô¤Áô×Ö¶Î10            C48
          from payment, meterinfo, custinfo,pbparmtemp
 where pid=c1
   and pmid = miid
   and micid = ciid
   order by c3 ;
 end ;
/

